Giacomo-Spano/ESP8266Webduino/Shield.cpp
#include "Shield.h"
#include "DoorSensor.h"
#include "HornSensor.h"
#include "Logger.h"
#include "Command.h"
#include "ESP8266Webduino.h"
#ifdef ESP8266
#include <Adafruit_ST7735.h>
#endif
#include "SensorFactory.h"
#include <ArduinoJson.h>          //https://github.com/bblanchon/ArduinoJson
#include "MQTTMessage.h"

#ifndef ESP8266
#include <FS.h> //this needs to be first, or it all crashes and burns...
#include "SPIFFS.h"
#endif

extern void resetWiFiManagerSettings();
extern bool mqtt_publish(MQTTMessage mqttmessage);
extern bool mqtt_subscribe(String topic);

extern void reboot(String reason);

Logger Shield::logger;
String Shield::tag = "Shield";

Shield::Shield()
{
	lastRestartDate = "";
	swVersion = "1.90";

	id = 0; //// inizializzato a zero perch� viene impostato dalla chiamata a registershield
	localPort = 80;
	serverName = /*"192.168.1.209"; //*/"giacomocasa.duckdns.org";
	mqttServer = /*"192.168.1.209"; //*/"giacomocasa.duckdns.org";
	mqttPort = 1883;
	serverPort = 8080;////9090;// 8080;
	shieldName = "shieldName";
	mqttUser = "giacomo";
	mqttPassword = "giacomo";
	mqttMode = true;// true;
	oleddisplay = false;
	nexiondisplay = 

	loragatewayEnabled = false;

	configMode = false;// true;
	resetSettings = false;// true;
	powerStatus = "on"; // da aggiungere
	lastCheckHealth = 0;
	rebootreason = "unknown";
}

Shield::~Shield()
{
	sensors.clear();
}

void Shield::writeConfig() {

	logger.println(tag, F(">>writeConfig"));
	DynamicJsonBuffer jsonBuffer;
	JsonObject& json = jsonBuffer.createObject();
	json["http_server"] = getServerName();
	json["http_port"] = getServerPort();
	json["mqtt_server"] = getMQTTServer();
	json["mqtt_port"] = getMQTTPort();
	json["mqtt_user"] = getMQTTUser();
	json["mqtt_password"] = getMQTTPassword();
	json["resetsettings"] = getResetSettings();
	json["shieldid"] = getShieldId();
	json["oled"] = getOledDisplay();
	json["loragateway"] = getLoRaGateway();
	json["loraaddress"] = getLoRaGatewayTargetAddress();
	json["loraserver"] = getLoRaGatewayServer();


	File configFile = SPIFFS.open(F("/config.json"), "w");
	if (!configFile) {
		logger.print(tag, F("<<writeConfig"));
		return;
	}

	json.printTo(Serial);
	json.printTo(configFile);
	configFile.close();
	logger.println(tag, F("config file writtten"));
	logger.println(tag, F("<<writeConfig"));
}

void Shield::readConfig() {

	logger.println(tag, F(">>readConfig"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/config.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/config.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());
				json.printTo(Serial);
				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));

					if (json.containsKey("http_server")) {
						logger.print(tag, F("\n\t http_server: "));
						String str = json["http_server"];
						logger.print(tag, str);
						setServerName(str);
					}
					if (json.containsKey("http_port")) {
						logger.print(tag, F("\n\t http_port: "));
						String str = json["http_port"];
						logger.print(tag, str);
						setServerPort(json["http_port"]);
					}
					if (json.containsKey("mqtt_server")) {
						logger.print(tag, "\n\t mqtt_server: ");
						String str = json["mqtt_server"];
						logger.print(tag, str);
						setMQTTServer(json["mqtt_server"]);
					}
					if (json.containsKey("mqtt_port")) {
						logger.print(tag, F("\n\t mqtt_port: "));
						String str = json["mqtt_port"];
						logger.print(tag, str);
						setMQTTPort(json["mqtt_port"]);
					}
					if (json.containsKey("mqtt_user")) {
						logger.print(tag, F("\n\t mqtt_user: "));
						String str = json["mqtt_user"];
						logger.print(tag, str);
						setMQTTUser(json["mqtt_user"]);
					}
					if (json.containsKey("mqtt_password")) {
						logger.print(tag, F("\n\t mqtt_password: "));
						String str = json["mqtt_password"];
						logger.print(tag, str);
						setMQTTPassword(json["mqtt_password"]);
					}
					if (json.containsKey("shieldid")) {
						logger.print(tag, F("\n\t shieldid: "));
						String str = json["shieldid"];
						logger.print(tag, str);
						setShieldId(json["shieldid"]);
					}
					if (json.containsKey("resetsettings")) {
						logger.print(tag, F("\n\t resetsettings: "));
						bool enabled = json["resetsettings"];
						logger.print(tag, Logger::boolToString(enabled));
						setResetSettings(json["resetsettings"]);
					}
					if (json.containsKey("oled")) {
						logger.print(tag, F("\n\t oled: "));
						bool enabled = json["oled"];
						logger.print(tag, Logger::boolToString(enabled));
						setOledDisplay(json["oled"]);
					}
					if (json.containsKey("loragateway")) {
						logger.print(tag, F("\n\t loragateway: "));
						bool enabled = /*false;//*/ json["loragateway"];
						logger.print(tag, Logger::boolToString(enabled));
						String targetaddress = "";
						if (json.containsKey("loraaddress")) {
							logger.print(tag, F("\n\t loraaddress: "));
							String address = json["loraaddress"];
							targetaddress = address;
							logger.print(tag, address);
						}
						bool serverenabled = false;
						if (json.containsKey("loraserver")) {
							logger.print(tag, F("\n\t loraserver: "));
							serverenabled = json["loraserver"];
							logger.print(tag, Logger::boolToString(serverenabled));

						}
						setLoRaGateway(enabled, targetaddress,serverenabled);

					}
					//writeConfig();
				}
				else {
					logger.print(tag, F("\n\t failed to load json config"));
					//clean FS, for testing
					//SPIFFS.format();
					writeConfig();
				}
			}
		}
	}
	else {
		logger.print(tag, F("\n failed to mount FS"));
		//SPIFFS.format();
		//logger.print(tag, F("\n\t loraserver: "));
		//serverenabled = json["loraserver"];
		//logger.print(tag, Logger::boolToString(serverenabled));
		
