Giacomo-Spano/ESP8266Webduino/Shield.cpp
	}
	logger.print(tag, F("\n<<readConfig"));
}


void Shield::init() {
	//tftDisplay.init();
	//display.init();
	status = "restart";
	shieldEvent = "";

#ifdef ESP8266
	espDisplay.init(D3, D4);
	//espDisplay.init(SDA, SCL); //sda scl
	//espDisplay.init(D4, D3); //sda scl
#endif

#ifdef TTGO
	espDisplay.init(4, 15);
#endif

	//espDisplay.init(SDA, SCL);

	
}

void Shield::clearAllSensors() {

	//sensorList.clearAll();
	sensors.clear();
}

Sensor* Shield::getSensorFromAddress(String addr) {

	for (int i = 0; i < sensors.size(); i++)
	{
		Sensor* sensor = (Sensor*)sensors.get(i);
		if (sensor->address == addr)
			return sensor;
	}
	return nullptr;
}

Sensor* Shield::getSensorFromId(int id) { /// sidsogna aggiungere anche richerca nei child
	logger.print(tag, F("\n\t >>Shield::getSensorFromId"));

	//logger.print(tag, String(F("\n\t sensors.size=")) + String(sensors.size()));
	for (int i = 0; i < sensors.size(); i++)
	{
		Sensor* sensor = (Sensor*)sensors.get(i);
		//logger.print(tag, String(F("\n\t sensorid=")) + String(sensor->sensorid));
		if (sensor->sensorid == id) {
			logger.print(tag, String(F("\n\t <<>Shield::getSensorFromId - found")));
			return sensor;
		}
		//logger.print(tag, String(F("\n\t childsensors.size=")) + String(sensor->childsensors.size()));
		for (int k = 0; k < sensor->childsensors.size(); k++) {
			Sensor* child = (Sensor*)sensor->childsensors.get(k);
			logger.print(tag, String(F("\n\t childsensorid=")) + String(child->sensorid));
			if (child->sensorid == id) {
				logger.print(tag, String(F("\n\t <<>Shield::getSensorFromId - found")));
				return (Sensor*)child;
			}
		}
	}
	logger.print(tag, String(F("\n\t <<>Shield::getSensorFromId - NOT found!")));
	return nullptr;
}


void Shield::drawStatus() {
	espDisplay.drawString(0, 0, status);
}

void Shield::drawMemory() {
	espDisplay.drawString(50, 0, "(" + String(freeMemory) + ")");
}

void Shield::drawEvent() {

	espDisplay.drawString(0, 10, shieldEvent);
}

void Shield::drawSWVersion() {

	String txt = logger.getStrDate();
	espDisplay.drawString(100, 0, "v" + swVersion);
}

void Shield::drawDateTime() {

	String txt = logger.getStrDate();
	espDisplay.drawString(0, 20, txt);
}

void Shield::drawLora() {

	//String txt = logger.getStrDate();
	espDisplay.drawString(0, 40, "++" + loraMessage);
}

void Shield::drawSensorsStatus() {

	int lines = 3;
	for (int i = 0; i < sensors.size(); i++)
	{
		Sensor* sensor = (Sensor*)sensors.get(i);
		if (!sensor->enabled)
			continue;
		String txt = sensor->sensorname.substring(0, 5);
		espDisplay.drawString(0, lines++ * 10, txt + ": " + String(sensor->getStatusText()));
		for (int k = 0; k < sensor->childsensors.size(); k++) {
			Sensor* child = (Sensor*)sensor->childsensors.get(k);
			txt = child->sensorname.substring(0, 5);
			espDisplay.drawString(0, lines++ * 10, txt + ": " + String(child->getStatusText()));
		}
	}
}

void Shield::drawString(int x, int y, String txt, int size, int color) {

	//tftDisplay.drawString(x, y, txt, 1, ST7735_WHITE);
	//tftDisplay.drawString(int row, int col, String txt, int size, int color);
}

/*Just as a heads up, to use the "drawXBitmap" function, I also had
to redefine the array from "static unsigned char" to "static const uint8_t PROGMEM"
in my image file.If I just used the original file, then garbage would appear on my 32x32 gird.
I think the array has to be defined as "PROGMEM" because the "drawXBitmap" function uses the
"pgm_read_byte" function, which reads a byte from program memory.I also had to include
the line "#include <avr/pgmspace.h>".After that, everything worked fine for me.*/

//#include <avr/pgmspace.h>
#define temperature_width 32
#define temperature_height 32
static const uint8_t /*PROGMEM*/ temperature_bits[] = {
	0x00, 0x80, 0x01, 0x00, 0x00, 0xe0, 0x07, 0x00, 0x00, 0x70, 0x0e, 0x00,
	0x00, 0x18, 0x18, 0x00, 0x00, 0x08, 0x18, 0x00, 0x00, 0x18, 0x18, 0x00,
	0x00, 0x18, 0x10, 0x00, 0x00, 0x78, 0x10, 0x00, 0x00, 0x18, 0x10, 0x00,
	0x00, 0x18, 0x10, 0x00, 0x00, 0x78, 0x10, 0x00, 0x00, 0x18, 0x10, 0x00,
	0x00, 0x08, 0x10, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00,
	0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00,
	0x00, 0xc8, 0x13, 0x00, 0x00, 0xc8, 0x13, 0x00, 0x00, 0xcc, 0x33, 0x00,
	0x00, 0xc4, 0x23, 0x00, 0x00, 0xe6, 0x67, 0x00, 0x00, 0xe2, 0x67, 0x00,
	0x00, 0xe6, 0x67, 0x00, 0x00, 0xe6, 0x67, 0x00, 0x00, 0xe6, 0x67, 0x00,
	0x00, 0xce, 0x71, 0x00, 0x00, 0x0c, 0x30, 0x00, 0x00, 0x3c, 0x3c, 0x00,
	0x00, 0xf0, 0x0f, 0x00, 0x00, 0xc0, 0x03, 0x00 };

void Shield::clearScreen() {
	//tftDisplay.clear();

	//tftDisplay.drawXBitmap(90, 50, temperature_bits, temperature_width, temperature_height, 0xF800/*ST3577_RED*/);
}

void Shield::parseMessageReceived(String topic, String message) {

	logger.print(tag, F("\n\t >>parseMessageReceived"));
	
	if (loraGateway != nullptr && loraGateway->getGatewayServer()) {

		logger.print(tag, "\n\n\t >PARSE MESSAGE AND SEND LORA MESSAGE");

		String topic2 = topic;
		topic2.replace("fromServer/shield/", "");
		topic2 = topic2.substring(0, 17);
		logger.print(tag, F("\n\t >>mac addr= "));
		logger.print(tag, topic2);
	
		//String topic = "prova/toserver";
		//String message = "{\"MAC\":\"24:0A : C4 : 08 : F7 : 5C\",\"swversion\":\"1.88\",\"lastreboot\":\"\",\"lastcheckhealth\":\"26600\",\"freemem\":\"215180\",\"localIP\":\"192.168.1.65\",\"localPort\":\"80\"}";

		String payload = String(topic.length()) + ";" + topic + ";" + 
						 String(message.length()) + ";" + message;
		logger.print(tag, "\n\t >>payload= " + payload);
		loraGateway->sendLoraMessage(payload);
		logger.print(tag, "\n\n\t >LORA MESSAGE SENT \n");
		return;
	}

	
	String str = String(F("fromServer/shield/")) + getMACAddress();
	logger.print(tag, String(F("\n\t str: ")) + str);

	logger.print(tag, String(F("\n\t topic: ")) + topic);
	if (topic.equals(str + F("/settings"))) {
		logger.print(tag, F("\n\t received shield settings\n"));
		logger.print(tag, message);
		logger.print(tag, F("\n"));
		setEvent(F("<-received settings"));

		size_t size = message.length();
		DynamicJsonBuffer jsonBuffer;
		JsonObject& json = jsonBuffer.parseObject(message);
		if (json.success()) {
			logger.print(tag, F("\n\t settings= \n"));
			logger.printJson(json);
		}
		else {
			logger.print(tag, F("failed to load json config"));
			return;
		}
		setRebootReason("unknown");
		if (loadSensors(json)) {
			writeSensorToFile(json);
			settingFromServerReceived = true;
			Command command;
			DynamicJsonBuffer jsonBuffer;
			JsonObject& json = jsonBuffer.createObject();
			getJson(json);
			String str;
			json.printTo(str);
			command.sendShieldStatus(str);

			writeConfig();
		}
	}
	else if (topic.equals(str + F("/reboot"))) {
		logger.print(tag, F("\n\t received reboot request"));
		setEvent(F("<-received reboot request"));
		reboot("reboot command");
	}
	else if (topic.equals(str + F("/resetsettings"))) {
		logger.print(tag, F("\n\t RESET SETTINGS!!!!!!!!!!!!!!!!"));
		setResetSettings(true);
		writeConfig();
		reboot("reset");
	}
	else if (topic.equals(str + F("/time"))) { // risposta a time
		logger.print(tag, F("\n\t received time"));
		setEvent(F("<-received time"));

		lastTimeRequest = millis();
		timeNeedToBeUpdated = false;
		bool timeRequestInprogress = false;

		time_t t = (time_t)atoll(message.c_str());
		logger.print(tag, F("\n\t time="));
		logger.print(tag, String(t));
		setTime(t);
	}
	else if (topic.equals(str + F("/command"))) {
		logger.print(tag, F("\n\t received command "));
		logger.print(tag, message);
		setEvent(F("<-received command"));
		receiveCommand(message);
	}

	else {
		logger.print(tag, F("\n\t PARSE NOT FOUND"));
	}
	logger.printFreeMem(tag, F("parseMessageReceived"));
	logger.print(tag, F("\n\t <<parseMessageReceived"));
}

