Giacomo-Spano/ESP8266Webduino/Shield.cpp
	for (int i = 0; i < sensors.size(); i++)
	{
		Sensor* sensor = (Sensor*)sensors.get(i);
		if (!sensor->enabled) {
			continue;
		}

		bool sendUpdate = false;
		bool res = sensor->checkStatusChange();
		if (res) {
			sendUpdate = true;
			setEvent(F("SENSOR STATUS CHANGED"));
			logger.println(tag, F("SENSOR STATUS CHANGED "));
			logger.print(tag, F("\n\t sensor "));
			logger.print(tag, sensor->sensorid);
			logger.print(tag, F("."));
			logger.print(tag, sensor->sensorname);
			logger.print(tag, F("\n\t sensor status changed - status: "));
			logger.print(tag, String(sensor->status));
		}

		unsigned long timeDiff = millis() - sensor->lastUpdateStatus;
		if (timeDiff > sensor->updateStatus_interval) {
			setEvent(F("SENSOR STATUS UPDATE TIMEOUT"));
			logger.println(tag, F("SENSOR STATUS UPDATE TIMEOUT "));
			logger.print(tag, F("\n\t sensor "));
			logger.print(tag, sensor->sensorid);
			logger.print(tag, F("."));
			logger.print(tag, sensor->sensorname);
			logger.print(tag, F("\n\t update status timeout"));
			sendUpdate = true;
		}

		if (sendUpdate) {
			logger.print(tag, F("\n\t SEND SENSOR UPDATE"));
			Command command;
			/*DynamicJsonBuffer jsonBuffer;
			JsonObject& json = jsonBuffer.createObject();
			sensor->getJson(json);*/

			/*StaticJsonBuffer<500> jsonBuffer;
			JsonObject& json = jsonBuffer.createObject();*/
			
			//json["date"] = logger.getStrDate();

			/*String str2;
			json.printTo(str2);
			logger.print(tag, str2);

			sensor->getJson(json);*/

			/*String str;
			json.printTo(str);
			logger.print(tag, str);*/
			String strJson = sensor->getStrJson();
			

			//bool res = command.sendSensorStatus(json);
			bool res = command.sendStrSensorStatus(strJson);
			logger.print(tag, F("\n\t SENSOR STATUS SENT - res="));
			logger.print(tag, Logger::boolToString(res));
			if (res) {
				sensor->lastUpdateStatus = millis();
			}
		}
	}
	//logger.print(tag, F("\n\t <<checkSensorsStatus"));
}

bool Shield::requestTime() {
	logger.print(tag, F("\n\t >>requestTimeFromServer"));
	setEvent(F("request server setting.."));
	timeNeedToBeUpdated = false;
	lastTimeRequest = millis();
	Command command;
	bool res = command.requestTime(getMACAddress());
	if (res)
		timeRequestInprogress = true;
	else
		timeRequestInprogress = false;
	logger.print(tag, F("\n\t <<requestTimeFromServer res="));
	logger.print(tag, Logger::boolToString(res));
	return res;
}

void Shield::checkTimeUpdateStatus() {
	unsigned long timediff;

	timediff = millis() - lastTimeRequest;
	if (timediff > timeSync_interval) {
		timeNeedToBeUpdated = true;
	}

	if (timeRequestInprogress && timediff > timeRequest_timeout) {
		timeNeedToBeUpdated = true;
	}

	if (timeNeedToBeUpdated && !timeRequestInprogress) {
		logger.println(tag, F("\n\n\n\-----------TIME UPDATE TIMEOUT --------\n\n"));
		setEvent(F("Request time"));
		bool res = requestTime();
		if (!res) { // se fallisce rirpova tra un minuto
			logger.println(tag, F("\n request setting failed"));
			lastTimeRequest = millis() - timeSync_interval + 1 * 60 * 1000;
		}
	}
}

void Shield::checkSettingResquestStatus() {

	unsigned long timediff = millis() - lastSettingRequest;
	if (timediff > settingsRequest_interval) {
		settingsNeedToBeUpdated = true;
	}

	if (settingsRequestInprogress && timediff > settingsRequest_timeout) {
		logger.println(tag, F("\n\n\n\-----------SERVER SETTINGS REQUEST TIMEOUT--------\n\n"));
		readSensorFromFile();
		settingsRequestInprogress = false;
		settingsNeedToBeUpdated = true;
	}

	if (!settingFromServerReceived && settingsNeedToBeUpdated && !settingsRequestInprogress) {
		logger.println(tag, F("\n\n\n\-----------SERVER SETTINGS TIMEOUT--------\n\n"));
		setEvent(F("Request setting"));
		bool res = requestSettingsFromServer();
		if (!res) { // se fallisce carica i dati da file
					// e riprova al prossimo timeout
			logger.println(tag, F("\n request setting failed"));
			lastSettingRequest = millis() - settingsRequest_interval + 1 * 60 * 1000;
			readSensorFromFile();
		}
	}
}

bool Shield::requestSettingsFromServer() {
	logger.print(tag, F("\n\t >>requestSettingsFromServer"));
	setEvent(F("request server setting.."));
	settingsNeedToBeUpdated = false;
	lastSettingRequest = millis();
	Command command;
	bool res = command.requestShieldSettings(getMACAddress(), rebootreason);
	if (res)
		settingsRequestInprogress = true;
	else
		settingsRequestInprogress = false;
	logger.print(tag, F("\n\t <<requestSettingsFromServer res="));
	logger.print(tag, Logger::boolToString(res));
	return res;
}

void Shield::readSensorFromFile() {
	logger.print(tag, F("\n\t >>readSensorFromFile"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/sensors.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/sensors.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());

				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));
					logger.printJson(json);
					loadSensors(json);
				}
				else {
					logger.print(tag, F("\n\t failed to load sensors file"));
				}
			}
		}
	}
	else {
		logger.print(tag, F("\n\t failed to mount FS"));
		//SPIFFS.format();
	}
	logger.print(tag, F("\n\t <<readSensorFromFile"));
}

bool Shield::writeSensorToFile(JsonObject& json) {
	File configFile = SPIFFS.open("/sensors.json", "w");
	if (!configFile) {
		logger.print(tag, F("\n\t failed to open config file for writing"));
	}
	logger.printJson(json);
	json.printTo(configFile);
	configFile.close();
}

// carica i settings
// può essere chiamat inn qualunque moneto: quanto riceve i setting dal server
// oppure quando all'inizio la scheda legge i setting dalla eprom
bool  Shield::loadSensors(JsonObject& json) {

	logger.print(tag, F("\n\t>>loadSensors"));

	if (json.containsKey("shieldid")) {
		int shieldid = json["shieldid"];
		logger.print(tag, F("\n\t shieldid="));
		logger.print(tag, shieldid);
		setShieldId(shieldid);
	}
	else {
		logger.print(tag, "\n\t error -ID MISSING");
		return false;
	}

	if (json.containsKey("name")) {
		String name = json["name"];
		logger.print(tag, F("\n\t name="));
		logger.print(tag, name);
		setShieldName(name);
	}

	if (json.containsKey("loragateway")) {
		bool loragateway = json["loragateway"];
		logger.print(tag, F("\n\t loragateway="));
		logger.print(tag, loragateway);

		String targetaddress;
		if (json.containsKey("loraaddress")) {
			String address = json["loraaddress"];
			targetaddress = address;
			logger.print(tag, F("\n\t loraaddress="));
			logger.print(tag, targetaddress);
		}
		bool serverenable;
		if (json.containsKey("loraserver")) {
			serverenable = json["loraserver"];
			logger.print(tag, F("\n\t loraserver="));
			logger.print(tag, serverenable);
		}
		setLoRaGateway(loragateway, targetaddress,serverenable);
	}

	if (json.containsKey("oled")) {
		bool oled = json["oled"];
		logger.print(tag, F("\n\t oled="));
		logger.print(tag, oled);
		setOledDisplay(oled);
	}

