Giacomo-Spano/ESP8266Webduino/Shield.cpp
	if (json.containsKey("sensors")) {
		String str = json["sensors"];
		size_t size = str.length();
		DynamicJsonBuffer jsonBuffer;
		JsonArray& sensorjsonarray = jsonBuffer.parseArray(str);

		clearAllSensors(); // serve per inizializzare
		//String sensorstr = sensorjsonarray.getFirst();
		for (int i = 0; i < sensorjsonarray.size(); i++) {
#ifdef ESP8266
			ESP.wdtFeed();
#endif // ESP8266
			logger.print(tag, F("\n\n\t SENSOR: "));
			//logger.printJson(tag, sensorstr);
			sensorjsonarray[i].printTo(Serial);

			Sensor* sensor = SensorFactory::createSensor(sensorjsonarray[i]);
			if (sensor != nullptr) {
				logger.print(tag, F("\n\n\t sensor="));
				logger.print(tag, sensor->toString());
				//sensorList.add(sensor);
				sensors.add(sensor);
				logger.print(tag, F("\n\n\t sensor num="));
				logger.print(tag, sensors.size());
			}
		}
	}
	else {
		logger.print(tag, F("\n\t No sensor found!"));
	}
	//logger.printFreeMem(tag, " end loadsensor");
	logger.print(tag, F("\n\t<<loadSensors\n"));
	return true;
}

#ifdef dopo
void Shield::addSensor(Sensor* pSensor) { // non è usata?????????

	logger.print(tag, F("\n\t >>addSensor "));
	logger.print(tag, pSensor->sensorname);
	sensorList.add((Sensor*)pSensor);
	//sensorList.show();
	logger.print(tag, F("\n\t <<addSensor"));
}
#endif

void Shield::setLoRaGateway(bool enable, String address, bool serverenabled)
{
	logger.print(tag, "\n\t >>setLoRaGateway");
	loragatewayEnabled = enable;

	if (!enable && loraGateway != nullptr) {
		delete loraGateway;
	}
	else if (enable && loraGateway == nullptr) {
		loraGateway = new LoRaGateway();
		loraGateway->init(address, serverenabled, &espDisplay);


		/*if (serverenabled) {
			String topic = "fromServer/shield/" + loraGateway->getTargetAddress() + "/#";
			logger.print(tag, F("\n\t Subscribe to topic:"));
			logger.print(tag, topic);
			mqtt_subscribe(topic.c_str());
		}*/


	}

	logger.print(tag, "\n\t <<setLoRaGateway=" + Logger::boolToString(loragatewayEnabled));
}

void Shield::writeRebootReason() {

	logger.println(tag, " >>writeRebootReason config");
	DynamicJsonBuffer jsonBuffer;
	JsonObject& json = jsonBuffer.createObject();
	json["rebootreason"] = getRebootReason();

	File configFile = SPIFFS.open("/reason.json", "w");
	if (!configFile) {
		logger.print(tag, "\n\t failed to open rebootreason file for writing");
		return;
	}

	json.printTo(Serial);
	json.printTo(configFile);
	configFile.close();
	logger.print(tag, "\n\t reason file written");
	logger.println(tag, "writeRebootReason config");
	//end save
}

void Shield::readRebootReason() {

	logger.println(tag, F(">>readRebootReason"));

	if (SPIFFS.begin()) {
		logger.print(tag, F("\n\t mounted file system"));
		if (SPIFFS.exists("/config.json")) {
			//file exists, reading and loading
			logger.print(tag, F("\n\t reading config file"));
			File configFile = SPIFFS.open("/reason.json", "r");
			if (configFile) {
				logger.print(tag, F("\n\t opened config file"));
				size_t size = configFile.size();
				// Allocate a buffer to store contents of the file.
				std::unique_ptr<char[]> buf(new char[size]);
				configFile.readBytes(buf.get(), size);
				DynamicJsonBuffer jsonBuffer;
				JsonObject& json = jsonBuffer.parseObject(buf.get());
				json.printTo(Serial);
				if (json.success()) {
					logger.print(tag, F("\n\t parsed json"));

					if (json.containsKey("rebootreason")) {
						Serial.println("rebootreason: ");
						String str = json["rebootreason"];
						logger.print(tag, str);
						String reason = json["rebootreason"];
						setRebootReason(str);
					}
				}
				else {
					logger.print(tag, F("\n\t failed to load json config"));
					//clean FS, for testing
					SPIFFS.format();
					writeConfig();
				}
			}
		}
	}
	else {
		logger.print(tag, F("failed to mount FS"));
	}
	logger.print(tag, F("<<readRebootReason"));
}

